output/posts/compiling-llvm/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Compiling LLVM | gramanas &gt;&gt; blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" id="css_theme" href="../../assets/css/theme.gray.css" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://gramanas.github.io/posts/compiling-llvm/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Anastasis Grammenos">
<meta property="og:site_name" content="gramanas &gt;&gt; blog">
<meta property="og:title" content="Compiling LLVM">
<meta property="og:url" content="https://gramanas.github.io/posts/compiling-llvm/">
<meta property="og:description" content="After looking through the 2018 GSoC projects LLVM
stands out as the most interesting one for me.



Before it's even time to contact anyone from the
project, I should at least build it first and verif">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-03-21T15:30:55+02:00">
</head>
<body>
    

    <header id="header" class="header transparent"><div class="container">
            <div class="scroll top">
                <a href="#"><i class="icon-chevron-up icon-large"></i></a>
            </div>

            
    <div class="brand">
        <div class="flip_container">
            <div class="flipper">
                <div class="front">
                    <p><a href="https://gramanas.github.io/" title="gramanas &gt;&gt; blog" rel="home">

                        <span id="blog-title">gramanas &gt;&gt; blog</span>
                    </a></p>
                </div>

                <div class="back">
                    <p><a href="https://gramanas.github.io/" title="LLVM development log for GSoC 2018" rel="home">
                        <span id="blog-description">LLVM development log for GSoC 2018</span>
                    </a></p>
                </div>			
            </div>
        </div>
    </div>

            
    <nav id="menu" role="navigation"><ul>
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
        <div class="separator clearfix"></div>
    </header><div class="body">
        <div id="main" class="container">
            
    <div class="post">
    
    <h1 class="p-name entry-title" itemprop="headline name">Compiling LLVM</h1>

        <div class="meta clearfix">
            <div class="authordate left">
                <time class="timeago" datetime="2018-03-21T15:30:55+02:00">2018/03/21</time>
            

            
          |  
        <a href="index.org" id="sourcelink">Source</a>

            </div>
            

    <div itemprop="keywords" class="tags right">
        <span class="tags">
            <span class="muted small"> <i class="icon-tag"></i> </span>
        </span>
    </div>

        </div>
        <p>
After looking through the 2018 GSoC projects LLVM
stands out as the most interesting one for me.
</p>

<p>
Before it's even time to contact anyone from the
project, I should at least build it first and verify that it passes
any tests they might have.
</p>

<p>
As I don't have much experience with building such complicated
and big projects, this took quite some time.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Build process</h2>
<div class="outline-text-2" id="text-1">
<p>
The project uses CMake as a build system, with many flags available to tune
the installation. After checking out the source code either from git or SVN
it's time to build it.
</p>

<p>
After some failed attempts and some Q&amp;A's in the IRC channel, I found the required flags
to build it in my system. Turns out I can have multiple build folders for 
differently configured builds, so my plan is to have one minimal build for developing purposes
and one full build to run the final tests before sending a patch.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Time concerns</h3>
<div class="outline-text-3" id="text-1-1">
<p>
My computer is old.
</p>

<p>
OK, it's not that old, but it is abused the last 6 years that I own it
and it's not top tier. Just a normal <code>i5</code> computer from the 2010s.
</p>

<p>
That said, the first time I built LLVM, it took more than 45 minutes.
</p>

<p>
There are various optimizations one could do to improve compilation times.
I already mentioned keeping two differently configured build folders.
I also installed <code>ccahce</code> since LLVM's <code>CMakeLists.txt</code> has a flag to
enable it's usage. C++ modules also help.
</p>

<p>
Ninja is recommended in the wiki, and it's probably the fastest one, so I use that as well.
</p>

<p>
Building with a minimal build and just the component I'm working on,
greatly reduces build times.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Configuration</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Here are the minimal build flags:
</p>
<div class="highlight"><pre><span></span><span class="nb">cd</span> /build/llvm-dev <span class="c1"># the minimal folder</span>
cmake -G Ninja -DCMAKE_EXPORT_COMPILE_COMMANDS<span class="o">=</span><span class="m">1</span> <span class="se">\</span>
      -DBUILD_SHARED_LIBS<span class="o">=</span><span class="nb">true</span> <span class="se">\</span>
      -DCMAKE_BUILD_TYPE<span class="o">=</span>Debug <span class="se">\</span>
      -DLLVM_ENABLE_ASSERTIONS<span class="o">=</span>ON <span class="se">\</span>
      -DCMAKE_CXX_COMPILER<span class="o">=</span>clang++ <span class="se">\</span>
      -DCMAKE_C_COMPILER<span class="o">=</span>clang <span class="se">\</span>
      -DLLVM_CCACHE_BUILD<span class="o">=</span>ON <span class="se">\</span>
      -DCLANG_ENABLE_ARCMT<span class="o">=</span>OFF <span class="se">\</span>
      -DCLANG_ENABLE_STATIC_ANALYZER<span class="o">=</span>OFF <span class="se">\</span>
      -DLLVM_TARGETS_TO_BUILD<span class="o">=</span><span class="s2">"X86;ARM;AArch64"</span> ~/code/llvm
</pre></div>

<p>
And here is the full build, basically the same but without the ARCMT and static analyzer disabled, plus it builds for all targets.
Also instead of <code>ccache</code> I enable the <code>C++</code> modules.
</p>

<div class="highlight"><pre><span></span><span class="nb">cd</span> /build/llvm-full <span class="c1"># the full build</span>
cmake -G Ninja -DCMAKE_EXPORT_COMPILE_COMMANDS<span class="o">=</span><span class="m">1</span> <span class="se">\</span>
      -DBUILD_SHARED_LIBS<span class="o">=</span><span class="nb">true</span> <span class="se">\</span>
      -DCMAKE_BUILD_TYPE<span class="o">=</span>Debug <span class="se">\</span>
      -DLLVM_ENABLE_ASSERTIONS<span class="o">=</span>ON <span class="se">\</span>
      -DCMAKE_CXX_COMPILER<span class="o">=</span>clang++ <span class="se">\</span>
      -DCMAKE_C_COMPILER<span class="o">=</span>clang <span class="se">\</span>
      -DLLVM_CCACHE_BUILD<span class="o">=</span>ON ~/code/llvm
</pre></div>
</div>
</div>
</div>
        
        <ul class="pager hidden-print">
<li class="next">
                <a href="../debug-information/" rel="next" title="Debug Information">Next post</a>
            </li>
        </ul>
</div>



        </div>
    </div>
    

    <footer class="footer"><div class="container clearfix">
            <div class="social pull-left">
                <ul>
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<a href="../../rss.xml" target="_blank">
                        <li> <i class="icon-rss icon-large"></i> 
                        </li>
                    </a>
                </ul>
</div>
            <div class="copyright pull-right">
                <p>Contents © 2018         <a href="mailto:anastasis.gramm2@gmail.com">Anastasis Grammenos</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
                
            </div>
            
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
